# GetRootId Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RevitLinkType..::..GetRootId Method
RevitLinkType Class See Also
---
Gets the id of the top-level link which this link is linked into.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public ElementId GetRootId()
```

Visual Basic
---
```text
Public Function GetRootId As ElementId
```

Visual C++
---
```text
public:
ElementId^ GetRootId()
```

# ### Return Value
The id of the top-level link which this link is ultimately linked under, or invalidElementId if this link is a top-level link.
# Remarks
This function will always return the id of a top-level link, or invalidElementId. Given the link structure A -> B -> C, then calling this function on C will return A's id. Call GetParentId to get B's id.
# See Also
RevitLinkType Class
Autodesk.Revit.DB Namespace